[
    {
      "id": "blackmail",
      "q": "Has the attacker claimed to have sensitive data or threatened to release private or confidential information publicly?",
      "follow_up": "What kind of sensitive data did they claim to have?",
      "template": "Data that hacker claimed to have: ",
      "attachments": ""
    },
    {
      "id": "hacker_contact",
      "q": "Did the attacker provide contact details or methods for further communication, such as email or a number or any other?",
      "follow_up": "What method of contact was provided?",
      "opt": ["Email", "Phone Number", "Social Media", "Other"],
      "template": "Method of further communication provided by hacker: ",
      "attachments": ""
    },
    {
      "id": "payment_method",
      "q": "Was a specific payment method requested (e.g., cryptocurrency, bank transfer, personal meet)?",
      "follow_up": "What payment method was requested?",
      "template": "Payment method requested by hacker: ",
      "attachments": ""
    },
    {
      "id": "security",
      "q": "Was any security software installed before the attack occurred?",
      "follow_up": "Was the software up to date and actively running?",
      "template": "Security software was up and running during attack: ",
      "attachments": ""
    },
    {
      "id": "spread",
      "q": "Is the device part of a larger network (e.g., corporate network)?",
      "follow_up": "Have other devices in the network shown signs of being affected?",
      "template": "Other devices on network have shown signs of being affected via malware: ",
      "attachments": ""
    },
    {
      "id": "suspect",
      "q": "Do you suspect any malicious emails, websites, or files might have led to the ransomware attack?",
      "follow_up": "Do you recall which email, website, or file it could be?",
      "template": "Email, website or file suspicion which might have led to ransomware attack: ",
      "attachments": ""
    },
    {
      "id": "security_settings",
      "q": "Have you made any changes to your security settings or systems following the attack?",
      "follow_up": "What changes did you make?",
      "template": "Security changes made on devices following the attack: ",
      "attachments": ""
    }
]